In [1]:
import pandas as pd
from sqlalchemy import create_engine
import config

In [2]:
players_by_state_path = "NBA_players_by_state.csv"

state_df = pd.read_csv(players_by_state_path)

In [3]:
state_df.head()

,Player,Yrs,G,MP,FG,FGA,3P,3PA,FT,FTA,...,Unnamed: 271,Unnamed: 272,Unnamed: 273,Unnamed: 274,Unnamed: 275,Unnamed: 276,Unnamed: 277,Unnamed: 278,Unnamed: 279,Unnamed: 280
0,Michael Ansley,3,149,2143,383,746,0,0,260,360,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Keith Askins,9,486,7983,677,1688,275,774,223,311,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Carl Bailey,1,1,7,1,1,0,0,0,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Charles Barkley*,16,1073,39330,8435,15605,538,2020,6349,8643,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Eric Bledsoe,7,380,10039,1657,3709,294,890,1042,1325,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
list(state_df)

['Player',
 'Yrs',
 'G',
 'MP',
 'FG',
 'FGA',
 '3P',
 '3PA',
 'FT',
 'FTA',
 'ORB',
 'TRB',
 'AST',
 'STL',
 'BLK',
 'TOV',
 'PF',
 'PTS',
 'FG%',
 '3P%',
 'FT%',
 'MP.1',
 'PTS.1',
 'TRB.1',
 'AST.1',
 'Date',
 'City',
 'State',
 'Unnamed: 28',
 'Unnamed: 29',
 'Unnamed: 30',
 'Unnamed: 31',
 'Unnamed: 32',
 'Unnamed: 33',
 'Unnamed: 34',
 'Unnamed: 35',
 'Unnamed: 36',
 'Unnamed: 37',
 'Unnamed: 38',
 'Unnamed: 39',
 'Unnamed: 40',
 'Unnamed: 41',
 'Unnamed: 42',
 'Unnamed: 43',
 'Unnamed: 44',
 'Unnamed: 45',
 'Unnamed: 46',
 'Unnamed: 47',
 'Unnamed: 48',
 'Unnamed: 49',
 'Unnamed: 50',
 'Unnamed: 51',
 'Unnamed: 52',
 'Unnamed: 53',
 'Unnamed: 54',
 'Unnamed: 55',
 'Unnamed: 56',
 'Unnamed: 57',
 'Unnamed: 58',
 'Unnamed: 59',
 'Unnamed: 60',
 'Unnamed: 61',
 'Unnamed: 62',
 'Unnamed: 63',
 'Unnamed: 64',
 'Unnamed: 65',
 'Unnamed: 66',
 'Unnamed: 67',
 'Unnamed: 68',
 'Unnamed: 69',
 'Unnamed: 70',
 'Unnamed: 71',
 'Unnamed: 72',
 'Unnamed: 73',
 'Unnamed: 74',
 'Unnamed: 75',
 'Unnamed: 76',
 'Unnamed: 77',
 'Unnamed: 78',
 'Unnamed: 79',
 'Unnamed: 80',
 'Unnamed: 81',
 'Unnamed: 82',
 'Unnamed: 83',
 'Unnamed: 84',
 'Unnamed: 85',
 'Unnamed: 86',
 'Unnamed: 87',
 'Unnamed: 88',
 'Unnamed: 89',
 'Unnamed: 90',
 'Unnamed: 91',
 'Unnamed: 92',
 'Unnamed: 93',
 'Unnamed: 94',
 'Unnamed: 95',
 'Unnamed: 96',
 'Unnamed: 97',
 'Unnamed: 98',
 'Unnamed: 99',
 'Unnamed: 100',
 'Unnamed: 101',
 'Unnamed: 102',
 'Unnamed: 103',
 'Unnamed: 104',
 'Unnamed: 105',
 'Unnamed: 106',
 'Unnamed: 107',
 'Unnamed: 108',
 'Unnamed: 109',
 'Unnamed: 110',
 'Unnamed: 111',
 'Unnamed: 112',
 'Unnamed: 113',
 'Unnamed: 114',
 'Unnamed: 115',
 'Unnamed: 116',
 'Unnamed: 117',
 'Unnamed: 118',
 'Unnamed: 119',
 'Unnamed: 120',
 'Unnamed: 121',
 'Unnamed: 122',
 'Unnamed: 123',
 'Unnamed: 124',
 'Unnamed: 125',
 'Unnamed: 126',
 'Unnamed: 127',
 'Unnamed: 128',
 'Unnamed: 129',
 'Unnamed: 130',
 'Unnamed: 131',
 'Unnamed: 132',
 'Unnamed: 133',
 'Unnamed: 134',
 'Unnamed: 135',
 'Unnamed: 136',
 'Unnamed: 137',
 'Unnamed: 138',
 'Unnamed: 139',
 'Unnamed: 140',
 'Unnamed: 141',
 'Unnamed: 142',
 'Unnamed: 143',
 'Unnamed: 144',
 'Unnamed: 145',
 'Unnamed: 146',
 'Unnamed: 147',
 'Unnamed: 148',
 'Unnamed: 149',
 'Unnamed: 150',
 'Unnamed: 151',
 'Unnamed: 152',
 'Unnamed: 153',
 'Unnamed: 154',
 'Unnamed: 155',
 'Unnamed: 156',
 'Unnamed: 157',
 'Unnamed: 158',
 'Unnamed: 159',
 'Unnamed: 160',
 'Unnamed: 161',
 'Unnamed: 162',
 'Unnamed: 163',
 'Unnamed: 164',
 'Unnamed: 165',
 'Unnamed: 166',
 'Unnamed: 167',
 'Unnamed: 168',
 'Unnamed: 169',
 'Unnamed: 170',
 'Unnamed: 171',
 'Unnamed: 172',
 'Unnamed: 173',
 'Unnamed: 174',
 'Unnamed: 175',
 'Unnamed: 176',
 'Unnamed: 177',
 'Unnamed: 178',
 'Unnamed: 179',
 'Unnamed: 180',
 'Unnamed: 181',
 'Unnamed: 182',
 'Unnamed: 183',
 'Unnamed: 184',
 'Unnamed: 185',
 'Unnamed: 186',
 'Unnamed: 187',
 'Unnamed: 188',
 'Unnamed: 189',
 'Unnamed: 190',
 'Unnamed: 191',
 'Unnamed: 192',
 'Unnamed: 193',
 'Unnamed: 194',
 'Unnamed: 195',
 'Unnamed: 196',
 'Unnamed: 197',
 'Unnamed: 198',
 'Unnamed: 199',
 'Unnamed: 200',
 'Unnamed: 201',
 'Unnamed: 202',
 'Unnamed: 203',
 'Unnamed: 204',
 'Unnamed: 205',
 'Unnamed: 206',
 'Unnamed: 207',
 'Unnamed: 208',
 'Unnamed: 209',
 'Unnamed: 210',
 'Unnamed: 211',
 'Unnamed: 212',
 'Unnamed: 213',
 'Unnamed: 214',
 'Unnamed: 215',
 'Unnamed: 216',
 'Unnamed: 217',
 'Unnamed: 218',
 'Unnamed: 219',
 'Unnamed: 220',
 'Unnamed: 221',
 'Unnamed: 222',
 'Unnamed: 223',
 'Unnamed: 224',
 'Unnamed: 225',
 'Unnamed: 226',
 'Unnamed: 227',
 'Unnamed: 228',
 'Unnamed: 229',
 'Unnamed: 230',
 'Unnamed: 231',
 'Unnamed: 232',
 'Unnamed: 233',
 'Unnamed: 234',
 'Unnamed: 235',
 'Unnamed: 236',
 'Unnamed: 237',
 'Unnamed: 238',
 'Unnamed: 239',
 'Unnamed: 240',
 'Unnamed: 241',
 'Unnamed: 242',
 'Unnamed: 243',
 'Unnamed: 244',
 'Unnamed: 245',
 'Unnamed: 246',
 'Unnamed: 247',
 'Unnamed: 248',
 'Unnamed: 249',
 'Unnamed: 250',
 'Unnamed: 251',
 'Unnamed: 252',
 'Unnamed: 253',
 'Unnamed: 254',
 'Unnamed: 255',
 'Unnamed: 256',
 'Unnamed: 257',
 'Unnamed: 258',
 'Unnamed: 259',
 'Unnamed: 260',
 'Unnamed: 261',
 'Unnamed: 262',
 'Unnamed: 263',
 'Unnamed: 264',
 'Unnamed: 265',
 'Unnamed: 266',
 'Unnamed: 267',
 'Unnamed: 268',
 'Unnamed: 269',
 'Unnamed: 270',
 'Unnamed: 271',
 'Unnamed: 272',
 'Unnamed: 273',
 'Unnamed: 274',
 'Unnamed: 275',
 'Unnamed: 276',
 'Unnamed: 277',
 'Unnamed: 278',
 'Unnamed: 279',
 'Unnamed: 280']

In [5]:
state_df = state_df[['Player',
 'Yrs',
 'G',
 'MP',
 'FG',
 'FGA',
 '3P',
 '3PA',
 'FT',
 'FTA',
 'ORB',
 'TRB',
 'AST',
 'STL',
 'BLK',
 'TOV',
 'PF',
 'PTS',
 'FG%',
 '3P%',
 'FT%',
 'MP.1',
 'PTS.1',
 'TRB.1',
 'AST.1',
 'Date',
 'City',
 'State',]]

In [6]:
state_df

,Player,Yrs,G,MP,FG,FGA,3P,3PA,FT,FTA,...,FG%,3P%,FT%,MP.1,PTS.1,TRB.1,AST.1,Date,City,State
0,Michael Ansley,3,149,2143,383,746,0,0,260,360,...,0.513,NaN,0.722,14.4,6.9,4.2,0.4,"Feb 8, 1967",Birmingham,Alabama
1,Keith Askins,9,486,7983,677,1688,275,774,223,311,...,0.401,0.355,0.717,16.4,3.8,2.9,0.8,"Dec 15, 1967",Athens,Alabama
2,Carl Bailey,1,1,7,1,1,0,0,0,0,...,1,NaN,NaN,7,2,0,0,"Apr 23, 1958",Birmingham,Alabama
3,Charles Barkley*,16,1073,39330,8435,15605,538,2020,6349,8643,...,0.541,0.266,0.735,36.7,22.1,11.7,3.9,"Feb 20, 1963",Leeds,Alabama
4,Eric Bledsoe,7,380,10039,1657,3709,294,890,1042,1325,...,0.447,0.33,0.786,26.4,12.2,3.7,4.4,"Dec 9, 1989",Birmingham,Alabama
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3556,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3557,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3558,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3559,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3560,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
players_path = "Resources/players.csv"

In [8]:
players_csv = pd.read_csv(players_path)

In [9]:
players_csv.head()

,_id,birthDate,birthPlace,career_AST,career_FG%,career_FG3%,career_FT%,career_G,career_PER,career_PTS,...,draft_pick,draft_round,draft_team,draft_year,height,highSchool,name,position,shoots,weight
0,abdelal01,"June 24, 1968","Cairo, Egypt",0.3,50.2,0.0,70.1,256,13.0,5.7,...,25th overall,1st round,Portland Trail Blazers,1990,6-10,"Bloomfield in Bloomfield, New Jersey",Alaa Abdelnaby,Power Forward,Right,240lb
1,abdulza01,"April 7, 1946","Brooklyn, New York",1.2,42.8,NaN,72.8,505,15.1,9.0,...,5th overall,1st round,Cincinnati Royals,1968,6-9,"John Jay in Brooklyn, New York",Zaid Abdul-Aziz,Power Forward and Center,Right,235lb
2,abdulka01,"April 16, 1947","New York, New York",3.6,55.9,5.6,72.1,1560,24.6,24.6,...,1st overall,1st round,Milwaukee Bucks,1969,7-2,"Power Memorial in New York, New York",Kareem Abdul-Jabbar,Center,Right,225lb
3,abdulma02,"March 9, 1969","Gulfport, Mississippi",3.5,44.2,35.4,90.5,586,15.4,14.6,...,3rd overall,1st round,Denver Nuggets,1990,6-1,"Gulfport in Gulfport, Mississippi",Mahmoud Abdul-Rauf,Point Guard,Right,162lb
4,abdulta01,"November 3, 1974","Maisons Alfort, France",1.1,41.7,23.7,70.3,236,11.4,7.8,...,11th overall,1st round,Sacramento Kings,1997,6-6,"Lycee Aristide Briand in Evreux, France",Tariq Abdul-Wahad,Shooting Guard,Right,223lb

In [51]:
player = players_csv[["_id", "name"]]

In [52]:
player = player.rename(columns={"_id": "player_id"})

In [12]:
player

      player_id                 name
0     abdelal01       Alaa Abdelnaby
1     abdulza01      Zaid Abdul-Aziz
2     abdulka01  Kareem Abdul-Jabbar
3     abdulma02   Mahmoud Abdul-Rauf
4     abdulta01    Tariq Abdul-Wahad
...         ...                  ...
4680  zizican01           Ante Zizic
4681   zoetji01             Jim Zoet
4682   zopfbi01            Bill Zopf
4683  zubaciv01          Ivica Zubac
4684  zunicma01           Matt Zunic

[4685 rows x 2 columns]

In [13]:
players_csv.columns

Index(['_id', 'birthDate', 'birthPlace', 'career_AST', 'career_FG%',
       'career_FG3%', 'career_FT%', 'career_G', 'career_PER', 'career_PTS',
       'career_TRB', 'career_WS', 'career_eFG%', 'college', 'draft_pick',
       'draft_round', 'draft_team', 'draft_year', 'height', 'highSchool',
       'name', 'position', 'shoots', 'weight'],
      dtype='object')

In [14]:
demographics = players_csv[['_id', 'height', 'weight', 'birthDate', 'birthPlace']]

In [15]:
demographics.head()

         _id height weight         birthDate              birthPlace
0  abdelal01   6-10  240lb     June 24, 1968            Cairo, Egypt
1  abdulza01    6-9  235lb     April 7, 1946      Brooklyn, New York
2  abdulka01    7-2  225lb    April 16, 1947      New York, New York
3  abdulma02    6-1  162lb     March 9, 1969   Gulfport, Mississippi
4  abdulta01    6-6  223lb  November 3, 1974  Maisons Alfort, France

In [16]:
weight = demographics["weight"].str.split("l", n = 1, expand = True)

In [17]:
demographics["weight"] = weight[0]

<ipython-input-17-1bcea5844532>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  demographics["weight"] = weight[0]

In [18]:
demographics

,_id,height,weight,birthDate,birthPlace
0,abdelal01,6-10,240,"June 24, 1968","Cairo, Egypt"
1,abdulza01,6-9,235,"April 7, 1946","Brooklyn, New York"
2,abdulka01,7-2,225,"April 16, 1947","New York, New York"
3,abdulma02,6-1,162,"March 9, 1969","Gulfport, Mississippi"
4,abdulta01,6-6,223,"November 3, 1974","Maisons Alfort, France"
...,...,...,...,...,...
4680,zizican01,6-11,254,"January 4, 1997","Split, Croatia"
4681,zoetji01,7-1,240,"December 20, 1953","Uxbridge, Canada"
4682,zopfbi01,6-1,170,"June 7, 1948",NaN
4683,zubaciv01,7-1,240,"March 18, 1997","Mostar, Bosnia and Herzegovina"
4684,zunicma01,6-3,195,"December 19, 1919","Renton, Pennsylvania"

In [19]:
birth_year = demographics["birthDate"].str.split(" ", n = 2, expand = True)

In [20]:
demographics["birth_year"] = birth_year[2]

<ipython-input-20-68eebbe7b72e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  demographics["birth_year"] = birth_year[2]

In [21]:
birth_city = demographics["birthPlace"].str.split(", ", n = 1, expand = True)

In [22]:
birth_city

                   0                       1
0              Cairo                   Egypt
1           Brooklyn                New York
2           New York                New York
3           Gulfport             Mississippi
4     Maisons Alfort                  France
...              ...                     ...
4680           Split                 Croatia
4681        Uxbridge                  Canada
4682             NaN                     NaN
4683          Mostar  Bosnia and Herzegovina
4684          Renton            Pennsylvania

[4685 rows x 2 columns]

In [23]:
demographics["birth_city"] = birth_city[0]

<ipython-input-23-6367c7930837>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  demographics["birth_city"] = birth_city[0]

In [24]:
demographics["birth_state"] = birth_city[1]

<ipython-input-24-8e36ce4f8109>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  demographics["birth_state"] = birth_city[1]

In [25]:
demographics

,_id,height,weight,birthDate,birthPlace,birth_year,birth_city,birth_state
0,abdelal01,6-10,240,"June 24, 1968","Cairo, Egypt",1968,Cairo,Egypt
1,abdulza01,6-9,235,"April 7, 1946","Brooklyn, New York",1946,Brooklyn,New York
2,abdulka01,7-2,225,"April 16, 1947","New York, New York",1947,New York,New York
3,abdulma02,6-1,162,"March 9, 1969","Gulfport, Mississippi",1969,Gulfport,Mississippi
4,abdulta01,6-6,223,"November 3, 1974","Maisons Alfort, France",1974,Maisons Alfort,France
...,...,...,...,...,...,...,...,...
4680,zizican01,6-11,254,"January 4, 1997","Split, Croatia",1997,Split,Croatia
4681,zoetji01,7-1,240,"December 20, 1953","Uxbridge, Canada",1953,Uxbridge,Canada
4682,zopfbi01,6-1,170,"June 7, 1948",NaN,1948,NaN,NaN
4683,zubaciv01,7-1,240,"March 18, 1997","Mostar, Bosnia and Herzegovina",1997,Mostar,Bosnia and Herzegovina
4684,zunicma01,6-3,195,"December 19, 1919","Renton, Pennsylvania",1919,Renton,Pennsylvania

In [26]:
height = demographics["height"].str.split("-", n = 1, expand = True)

In [27]:
height = height.astype("int64")

In [28]:
height[0].dtype

dtype('int64')

In [29]:
height['feet'] = height[0]*12

In [30]:
height['height'] = height['feet'] + height[1]

In [31]:
demographics['height'] = height['height']

<ipython-input-31-442884fc7dcc>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  demographics['height'] = height['height']

In [32]:
demographics

,_id,height,weight,birthDate,birthPlace,birth_year,birth_city,birth_state
0,abdelal01,82,240,"June 24, 1968","Cairo, Egypt",1968,Cairo,Egypt
1,abdulza01,81,235,"April 7, 1946","Brooklyn, New York",1946,Brooklyn,New York
2,abdulka01,86,225,"April 16, 1947","New York, New York",1947,New York,New York
3,abdulma02,73,162,"March 9, 1969","Gulfport, Mississippi",1969,Gulfport,Mississippi
4,abdulta01,78,223,"November 3, 1974","Maisons Alfort, France",1974,Maisons Alfort,France
...,...,...,...,...,...,...,...,...
4680,zizican01,83,254,"January 4, 1997","Split, Croatia",1997,Split,Croatia
4681,zoetji01,85,240,"December 20, 1953","Uxbridge, Canada",1953,Uxbridge,Canada
4682,zopfbi01,73,170,"June 7, 1948",NaN,1948,NaN,NaN
4683,zubaciv01,85,240,"March 18, 1997","Mostar, Bosnia and Herzegovina",1997,Mostar,Bosnia and Herzegovina
4684,zunicma01,75,195,"December 19, 1919","Renton, Pennsylvania",1919,Renton,Pennsylvania

In [33]:
demographics = demographics[["_id", "height", "weight", "birth_year", "birth_city", "birth_state"]]

In [34]:
demographics = demographics.rename(columns={"_id": "player_id"})

In [35]:
demographics.fillna("N/A", inplace=True)

In [36]:
demographics

,player_id,height,weight,birth_year,birth_city,birth_state
0,abdelal01,82,240,1968,Cairo,Egypt
1,abdulza01,81,235,1946,Brooklyn,New York
2,abdulka01,86,225,1947,New York,New York
3,abdulma02,73,162,1969,Gulfport,Mississippi
4,abdulta01,78,223,1974,Maisons Alfort,France
...,...,...,...,...,...,...
4680,zizican01,83,254,1997,Split,Croatia
4681,zoetji01,85,240,1953,Uxbridge,Canada
4682,zopfbi01,73,170,1948,N/A,N/A
4683,zubaciv01,85,240,1997,Mostar,Bosnia and Herzegovina
4684,zunicma01,75,195,1919,Renton,Pennsylvania

In [37]:
players_csv.count()

_id            4685
birthDate      4657
birthPlace     4185
career_AST     4685
career_FG%     4685
career_FG3%    3557
career_FT%     4685
career_G       4685
career_PER     4685
career_PTS     4685
career_TRB     4685
career_WS      4685
career_eFG%    3557
college        4372
draft_pick     3369
draft_round    3507
draft_team     3507
draft_year     3306
height         4685
highSchool     4025
name           4685
position       4685
shoots         4684
weight         4680
dtype: int64

In [40]:
salary_path = "Resources/salaries_1985to2018.csv"

In [41]:
salary_csv = pd.read_csv(salary_path)

In [42]:
salary_csv.head()

,league,player_id,salary,season,season_end,season_start,team
0,NBA,abdelal01,395000,1990-91,1991,1990,Portland Trail Blazers
1,NBA,abdelal01,494000,1991-92,1992,1991,Portland Trail Blazers
2,NBA,abdelal01,500000,1992-93,1993,1992,Boston Celtics
3,NBA,abdelal01,805000,1993-94,1994,1993,Boston Celtics
4,NBA,abdelal01,650000,1994-95,1995,1994,Sacramento Kings

In [43]:
salary_csv.count()

league          14163
player_id       14163
salary          14163
season          14163
season_end      14163
season_start    14163
team            14159
dtype: int64

In [44]:
grouped_salary = salary_csv.groupby(salary_csv["player_id"])

In [45]:
grouped_salary_df = grouped_salary.mean()

In [46]:
grouped_salary_df = grouped_salary[["salary"]]

In [47]:
grouped_salary_df

In [48]:
grouped_salary_df = grouped_salary_df[["salary"]]

IndexError: Column(s) ['salary'] already selected

In [ ]:
grouped_salary_df

In [ ]:
players_salary_df = grouped_salary_df.merge(players_csv, left_on="player_id", right_on="_id")

In [ ]:
players_salary_df

In [54]:
password=config.password

engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/NBA2')

In [55]:
player.to_sql(name='player', con=engine, if_exists='replace', index=False)

InternalError: (psycopg2.errors.DependentObjectsStillExist) cannot drop table player because other objects depend on it
DETAIL:  constraint fk_demographics_player_id on table demographics depends on table player
constraint fk_salary_player_id on table salary depends on table player
constraint fk_position_player_id on table "position" depends on table player
constraint fk_draft_player_id on table draft depends on table player
constraint fk_schools_player_id on table schools depends on table player
HINT:  Use DROP ... CASCADE to drop the dependent objects too.

[SQL:
DROP TABLE player]
(Background on this error at: http://sqlalche.me/e/13/2j85)